Repository: hikmatazimzade/pdf-quiz-maker
Catalog: main_project/locale/*/LC_MESSAGES/django.po
Languages: az

source: Minimum length of password should be 8!
az: Parolun minimum uzunluğu 8 olmalıdır!

source: Password
az: Parol

source: Remember Me
az: Məni Xatırla

source: The minimum length of username should be 7!
az: İstifadəçi adının minimum uzunluğu 7 olmalıdır!

source: Username
az: İstifadəçi Adı

source: First Name
az: Ad

source: Last Name
az: Soyad

source: The minimum length of password should be 8!
az: Parolun minimum uzunluğu 8 olmalıdır!

source: Confirm Password
az: Parolu Təsdiqlə

source: The user with this email already exists!
az: Bu email'e malik istifadəçi artıq mövcuddur!

source: The passwords don't match!
az: Parollar uyuşmur!

source: The user with this username already exists!
az: Bu istifadəçi adına malik hesab artıq mövcuddur!

source: User with this email doesn't exist!
az: Bu email'ə malik hesab mövcud deyil!

source: The length of code must be 5!
az: Kodun minimum uzunluğu 5 olmalıdır!

source: Input the code
az: Kodu daxil edin

source: Input the code that was sent to your email!
az: Email'nizə göndərilmiş kodu daxil edin!

source: New Password
az: Yeni Parol

source: Input Picture!
az: Şəkil daxil edin!

source: The minim password length must be 8!
az: Parol minimum uzunluğu 8 olmalıdır!

source: Old Password
az: Əvvəlki Parol

source: Confirm New Password
az: Yeni Parolu Təsdiqlə

source: Already logged in!
az: Artıq hesaba daxil olmusunuz!

source: Try again later!
az: Daha sonra yenidən cəhd edin!

source: Successfully Logged in!
az: Uğurla giriş edildi

source: Email or password is wrong!
az: E-poçt və ya parol səhvdir!

source: Successfully logged in!
az: Uğurla daxil olundu!

source: Input this code to verify your email
az: Bu kodu daxil edərək email'nizi doğrulayın

source: An error occured!
az: Xəta Baş Verdi!

source: Failed to send email. Please try again.
az: Email göndərilən zaman xəta baş verdi. Zəhmət olmasa yenidən cəhd edin!

source: Verification code expired!
az: Verifikasiya Kodunun vaxtı bitib!

source: You've sent too many resend requests!
az: Yüksək miqdarda təkrar sorğusu göndərdiniz!

source: Input your email again!
az: Email'nizi yenidən daxil edin!

source: The new password can't be same with the previous one!
az: Yeni parol əvvəlki ilə eyni ola bilməz!

source: Your password was successfully updated!
az: Parolunuz uğurla yeniləndi!

source: Successfully updated profile information!
az: Profil məlumatı uğurla yeniləndi!

source: Successfully changed your password!
az: Parolunuz uğurla dəyişdirildi!

source: Input your current password right!
az: Cari parolunuzu düzgün daxil edin!

source: Logged out of your account!
az: Hesabınızdan çıxdınız!

source: English
az: İngiliscə

source: Azerbaijani
az: Azərbaycanca

source: The minimum length of subject must be 5!
az: Mövzunun minimum uzunluğu 5 olmalıdır!

source: The minimum length of message must be 30!
az: Mesajın minimum uzunluğu 30 olmalıdır!

source: The pdf with this name already exists!
az: Bu ada malik pdf artıq mövcuddur!

source: This quiz doesn't exist!
az: Bu quiz mövcud deyil!

source: There are not this many questions in this quiz!
az: Quiz' də bu qədər sual mövcud deyil!

source: There are not this many tests in this pdf!
az: Pdf' də bu qədər test mövcud deyil!

source: Successfully saved!
az: Uğurla yadda saxlanıldı!

source: Quiz successfully deleted!
az: Quiz uğurla silindi!

source: Quiz successfully created!
az: Quiz uğurla yaradıldı!

source: You have sent too many messages!
az: Yüksək sayda mesaj göndərdiniz!

source: Change Password
az: Parolu Dəyişmək

source: Account Settings
az: Hesab Tənzimləmələri

source: Set New Password
az: Yeni Parol Təyin Etmək

source: Enter and confirm your new password.
az: Yeni parol daxil edib təsdiqləyin.

source: Set Password
az: Parol Dəyişmək

source: Verification Code
az: Verifikasiya Kodu

source: Enter the 5-digit code sent to your email.
az: Email'nizə göndərilmiş 5 rəqəmli kodu daxil edin.

source: Verify Code
az: Kodu doğrulayın

source: Didn't receive a code?
az: Kod email'nizə gəlmədi?

source: Resend
az: Yenidən Göndər

source: Email Verification
az: Email verifikasiyası

source: Reset Password
az: Parolu Sıfırlamaq

source: Enter your email to receive the verification code.
az: Verifikasiya kodu almaq üçün email adresinizi daxil edin.

source: Send Verification Code
az: Verifikasiya Kodu Göndər

source: Return to Home Page
az: Ana Səhifəyə Qayıt

source: Remembered your password?
az: Parolunuzu xatırladınız

source: Login
az: Giriş

source: Please enter your email and password!
az: Email və parolunuzu daxil edin!

source: Forgot password?
az: Parolu unutdunuz?

source: Don't have an account?
az: Hesabınız yoxdur?

source: Sign Up
az: Qeydiyyat

source: Profile
az: Profil

source: Profile Picture
az: Profil Şəkli

source: Save
az: Təsdiqlə

source: Register
az: Qeydiyyat

source: Please enter your details to create an account!
az: Hesab yaratmaq üçün məlumatlarınızı daxil edin!

source: Made By Hikmet
az: Hikmət tərəfindən hazırlanmışdır

source: Logout
az: Hesabdan Çıxış

source: Sign out
az: Hesabdan Çıxış

source: Home
az: Ana Səhifə

source: About
az: Haqqında

source: Contact
az: Əlaqə

source: View Profile
az: Profili Görüntülə

source: Login/Register
az: Giriş/Qeydiyyat

source: Oops! Page not found.
az: Oops!Səhifə tapılmadı.

source: We're sorry, but the page you were looking for doesn't exist. You might have typed the wrong address or the page may have moved.
az: Üzr istəyirik, amma axtardığınız səhifə mövcud deyil. Ünvan səhv daxil edilmiş və ya səhifə köçürülmüş olar bilər

source: Back to Homepage
az: Ana səhifəyə qayıt

source: About PDF Quiz Maker
az: Pdf Quiz Maker Haqqında

source: PDF Quiz Maker is an innovative tool designed to streamline the process of creating quizzes from PDF documents. Our platform allows educators, students, and professionals to automatically generate quiz questions based on highlighted text within a PDF. This simplifies the quiz creation process, saving time and ensuring that key concepts are captured effectively.
az: PDF Quiz Maker, PDF sənədlərindən testlər yaratmaq prosesini asanlaşdırmaq üçün nəzərdə tutulmuş yenilikçi bir vasitədir. Platformamız müəllimlərə, tələbələrə və mütəxəssislərə PDF daxilində vurğulanmış mətn əsasında avtomatik olaraq quiz sualları yaratmağa imkan verir. Bu, quiz yaradılması prosesini asanlaşdırır, vaxta qənaət edir və əsas anlayışların effektiv şəkildə tutulmasını təmin edir.

source: With our user-friendly interface, creating a quiz is as easy as uploading your PDF and selecting the text to include. Our system handles the rest, giving you a ready-to-use quiz that can be shared, printed, or integrated into learning management systems.
az: Bizim istifadəçi dostu interfeysimizlə quiz yaratmaq PDF-i yükləmək və daxil ediləcək mətni seçmək qədər asandır. Sistemimiz qalan məsələləri həll edir, sizə paylaşıla, çap oluna və ya öyrənmə idarəetmə sistemlərinə inteqrasiya oluna bilən istifadəyə hazır quiz təqdim edir.

source: At PDF Quiz Maker, we are committed to providing a valuable resource for educational technology and e-learning communities. We continuously improve our service based on user feedback and the latest educational trends. Join us in revolutionizing the way quizzes are created and utilized for education and training!
az: PDF Quiz Maker-da biz təhsil texnologiyaları və e-təhsil icmaları üçün dəyərli resurs təqdim etməyə sadiqik. İstifadəçi rəyləri və ən son təhsil tendensiyaları əsasında xidmətimizi davamlı olaraq təkmilləşdiririk. Təhsil və təlimdə quiz' lərin yaradılması üsulunu dəyişdirmək üçün bizə qoşulun!

source: Features:
az: Xüsusiyyətlər

source: Automatic quiz generation from highlighted text
az: Vurğulanmış mətndən avtomatik quiz yaradılması

source: User-friendly interface for seamless quiz creation
az: Rahat quiz yaratmaq üçün istifadəçi dostu interfeys

source: Support for multiple question types
az: Çoxlu sual növləri üçün dəstək

source: Integration capabilities with popular learning platforms
az: Məşhur öyrənmə platformaları ilə inteqrasiya imkanları

source: Customizable quiz options to fit educational needs
az: Təhsil ehtiyaclarına uyğunlaşdırıla bilən quiz seçimləri

source: Contact us
az: Əlaqə

source: Do you have any questions? Please do not hesitate to contact us directly.
az: Hər hansı bir sualınız var? Bizimlə birbaşa əlaqə saxlaya bilərsiniz.

source: Your name
az: Adınız

source: Your email
az: Email Adresiniz

source: Subject
az: Mövzu

source: Your message
az: Mesajınız

source: SEND
az: Göndər

source: Create Quiz
az: Yeni Quiz

source: Quiz Name
az: Quiz adı

source: Quiz Question Number
az: Quiz Sual Nömrəsi

source: Show Question Number
az: Sual Nömrəsini Göstər

source: Variant Number
az: Variant Sayı

source: Edit Quiz
az: Dəyişiklik Etmək

source: Save Changes
az: Redakte Et

source: Delete Quiz
az: Quiz'i Sil

source: Welcome to PDF Quiz Maker!
az: PDF QUIZ MAKER'a Xoş Gəldiniz!

source: Turn your PDFs into interactive quizzes with just a few clicks
az: Bir neçə kliklə PDF-lərinizi interaktiv quiz'lərə çevirin

source: Create New Quiz
az: Yeni Quiz yaradın

source: Usage of Pdf Quiz Maker
az: Pdf Quiz Maker'dan istifadə qaydası

source: Step 1
az: Addım 1

source: Highlight correct answers in your pdf
az: PDF'nizdə düzgün cavabları işarələyin

source: Step 2
az: Addım 2

source: Upload your PDF with highlighted text
az: İşarələdiyiniz PDF'i yükləyin

source: Step 3
az: Addım 3

source: Review and edit your quiz
az: Quiz'nizi nəzərdən keçirin və redaktə edin

source: Step 4
az: Addım 4

source: Generate and solve your quiz
az: Quiz'nizi yaradın və həll edin

source: Need Help? Reach out to us at
az: Dəstəyə ehtiyacınız var? Bizə yazın

source: Contact Page
az: Əlaqə Səhifəsi

source: Next
az: Növbəti

source: Back to Quiz Choice Page
az: Quiz Seçim ekranına geri qayıt

source: Quiz Choice
az: Quiz Seçimi

source: Test Number:
az: Test Sayı:

source: Show Numbers:Active
az: Nömrələri Göstər: Aktiv

source: Show Numbers: Deactive
az: Nömrələri Göstər: Deaktiv

source: Start Quiz
az: Quiz'ə başlamaq

source: User Guide
az: İstifadəçi Rəhbəri

source: Quiz Maker User Guide
az: Quiz Maker İstifadəçi Rəhbəri

source: 1. Highlighting Answers in PDF
az: 1. PDF-də cavabların işarələnməsi

source: Make sure all the answers in PDF are highlighted (especially variants like A), B), etc.). Otherwise, the answers might be mixed up during quiz generation.
az: PDF-dəki bütün cavabların vurğulandığından əmin olun (xüsusilə A), B) və s. kimi variantlar). Əks halda, sorğunun yaradılması zamanı sualların cavabları qarışa bilər.

source: 2. Single Answer for Each Question
az: 2. Hər Sual üçün Tək Cavab

source: Ensure that only one answer is highlighted for each question in your PDF. Multiple highlighted answers for a single question can lead to incorrect quiz generation.
az: PDF-inizdə hər sual üçün yalnız bir cavabın vurğulandığından əmin olun. Bir sual üçün bir neçə vurğulanmış cavab yanlış quiz'in yaradılmasına səbəb ola bilər.

source: 3. Consistent Variant Number
az: 3. Ardıcıl Variant Nömrəsi

source: Each test should have the same number of variants consistently. If you have a varying number of variants across questions, it may cause issues in the quiz structure.
az: Hər bir test ardıcıl olaraq eyni sayda varianta malik olmalıdır. Suallarda müxtəlif sayda variant varsa, bu, quiz strukturunda problemlər yarada bilər.

source: 4. Page Numbers and Formatting
az: 4. Səhifə Nömrələri və Formatlaşdırma

source: Keep an eye on page numbers and formatting in your PDF documents. Ensure that questions and answers are clear, and page breaks do not disrupt the readability of content.
az: PDF sənədlərinizdə səhifə nömrələrinə və formatına diqqət yetirin. Sualların və cavabların aydın olduğundan və səhifə fasilələrinin məzmunun oxunaqlılığını pozmadığından əmin olun.

source: 5. Use Clear and Legible Fonts
az: 5. Aydın və Oxunan Şriftlərdən istifadə edin

source: When creating PDFs for quiz generation, use clear and legible fonts. Avoid decorative or hard-to-read fonts that may lead to misinterpretation of content.
az: Quiz yaratmaq üçün PDF daxilində aydın və oxunaqlı şriftlərdən istifadə edin. Məzmunun yanlış təfsirinə səbəb ola biləcək dekorativ və ya çətin oxunan şriftlərdən çəkinin.

source: There are not this many tests in this range!
az: Bu aralıqda bu qədər test mövcud deyil!

source: Quiz Question Range
az: Quiz Sual Aralığı

source: The maximum quiz limit for each account is 8!
az: Hər hesab üçün maksimum quiz limiti 8-dir!

source: Shuffle Variants
az: Variantları Qarışdır

source: You have uploaded many PDFs recently; please try again {remaining} {minute_text} later!
az: Yüksək miqdarda PDF daxil etmisiniz; zəhmət olmasa {remaining} dəqiqə sonra yenidən cəhd edin!

source: Loading
az: Yüklənmə

source: Quiz is being created...
az: Quiz Yaradılır...

source: Your message was successfully sent!
az: Mesajınız uğurla göndərildi!
